using System;
using System.Collections.Generic;
using System.IO;
using System.Linq;
using System.Runtime.InteropServices.WindowsRuntime;
using Windows.Foundation;
using Windows.Foundation.Collections;
using Windows.System;
using Windows.UI.Xaml;
using Windows.UI.Xaml.Controls;
using Windows.UI.Xaml.Controls.Primitives;
using Windows.UI.Xaml.Data;
using Windows.UI.Xaml.Input;
using Windows.UI.Xaml.Media;
using Windows.UI.Xaml.Media.Animation;
using Windows.UI.Xaml.Navigation;

// https://go.microsoft.com/fwlink/?LinkId=402352&clcid=0x804 上介绍了“空白页”项模板

namespace Weather
{
    /// <summary>
    /// 可用于自身或导航至 Frame 内部的空白页。
    /// </summary>
    public sealed partial class MainPage : Page
    {
        public MainPage()
        {
            this.InitializeComponent();
        }



        private void ContentFrame_NavigationFailed(object sender, NavigationFailedEventArgs e)
        {
            throw new Exception("Failed to load Page " + e.SourcePageType.FullName);
        }

        // List of ValueTuple holding the Navigation Tag and the relative Navigation Page
        private readonly List<(string Tag, Type Page)> _pages = new List<(string Tag, Type Page)>
        {
            ("home", typeof(HomePage)),
            ("Collection", typeof(Collection)),
   
        };

        private void NavView_Loaded(object sender, RoutedEventArgs e)
        {
            ContentFrame.Navigated += On_Navigated;

            // NavView doesn't load any page by default, so load home page.
            NavView.SelectedItem = NavView.MenuItems[0];
            // If navigation occurs on SelectionChanged, this isn't needed.
            // Because we use ItemInvoked to navigate, we need to call Navigate
            // here to load the home page.
            NavView_Navigate("home", new EntranceNavigationTransitionInfo());

            // Add keyboard accelerators for backwards navigation.
            var goBack = new KeyboardAccelerator { Key = VirtualKey.GoBack };
            goBack.Invoked += BackInvoked;
            this.KeyboardAccelerators.Add(goBack);

            // ALT routes here
            var altLeft = new KeyboardAccelerator
            {
                Key = VirtualKey.Left,
                Modifiers = VirtualKeyModifiers.Menu
            };
            altLeft.Invoked += BackInvoked;
            this.KeyboardAccelerators.Add(altLeft);
        }

        private void NavView_ItemInvoked(NavigationView sender, NavigationViewItemInvokedEventArgs args)
        {
            if (args.IsSettingsInvoked == true)
            {
                NavView_Navigate("settings", args.RecommendedNavigationTransitionInfo);
            }
            else if (args.InvokedItemContainer != null)
            {
                var navItemTag = args.InvokedItemContainer.Tag.ToString();
                NavView_Navigate(navItemTag, args.RecommendedNavigationTransitionInfo);
            }
        }

        /* NavView_SelectionChanged is not used in this example, but is shown for completeness.
             You will typically handle either ItemInvoked or SelectionChanged to perform navigation,
             but not both. */
        private void NavView_SelectionChanged(NavigationView sender, NavigationViewSelectionChangedEventArgs args)
        {
            if (args.IsSettingsSelected == true)
            {
                NavView_Navigate("settings", args.RecommendedNavigationTransitionInfo);
            }
            else if (args.SelectedItemContainer != null)
            {
                var navItemTag = args.SelectedItemContainer.Tag.ToString();
                NavView_Navigate(navItemTag, args.RecommendedNavigationTransitionInfo);
            }
        }

        private void NavView_Navigate(string navItemTag, NavigationTransitionInfo transitionInfo)
        {
            
            Type _page = null;
            if (navItemTag == "settings")
            {
                _page = typeof(SettingsPage);
            }
            else
            {
                var item = _pages.FirstOrDefault(p => p.Tag.Equals(navItemTag));
                _page = item.Page;
            }
            // Get the page type before navigation so you can prevent duplicate
            // entries in the backstack.
            var preNavPageType = ContentFrame.CurrentSourcePageType;

            // Only navigate if the selected page isn't currently loaded.
            if (!(_page is null) && !Type.Equals(preNavPageType, _page))
            {
                ContentFrame.Navigate(_page, null, transitionInfo);
            }
        }

        private void NavView_BackRequested(NavigationView sender, NavigationViewBackRequestedEventArgs args)
        {
            On_BackRequested();
        }

        private void BackInvoked(KeyboardAccelerator sender,
                                 KeyboardAcceleratorInvokedEventArgs args)
        {
            On_BackRequested();
            args.Handled = true;
        }

        private bool On_BackRequested()
        {
            if (!ContentFrame.CanGoBack)
                return false;

            // Don't go back if the nav pane is overlayed.
            if (NavView.IsPaneOpen &&
                (NavView.DisplayMode == NavigationViewDisplayMode.Compact ||
                 NavView.DisplayMode == NavigationViewDisplayMode.Minimal))
                return false;

            ContentFrame.GoBack();
            return true;
        }

        private void On_Navigated(object sender, NavigationEventArgs e)
        {
            NavView.IsBackEnabled = ContentFrame.CanGoBack;

            if (ContentFrame.SourcePageType == typeof(SettingsPage))
            {
                // SettingsItem is not part of NavView.MenuItems, and doesn't have a Tag.
                NavView.SelectedItem = (NavigationViewItem)NavView.SettingsItem;
                NavView.Header = "Settings";
            }
            else if (ContentFrame.SourcePageType != null)
            {
                var item = _pages.FirstOrDefault(p => p.Page == e.SourcePageType);

                NavView.SelectedItem = NavView.MenuItems
                    .OfType<NavigationViewItem>()
                    .First(n => n.Tag.Equals(item.Tag));

                NavView.Header =
                    ((NavigationViewItem)NavView.SelectedItem)?.Content?.ToString();
            }
        }

        private void NavViewSearchBox_TextChanged(AutoSuggestBox sender, AutoSuggestBoxTextChangedEventArgs args)
        {
            //当搜索框内文字变化时在城市列表进行匹配
            if (args.Reason == AutoSuggestionBoxTextChangeReason.UserInput)
            {
                sender.ItemsSource = arrsrc.Where(i => i.Contains(sender.Text));
            }
        }

        private void NavViewSearchBox_SuggestionChosen(AutoSuggestBox sender, AutoSuggestBoxSuggestionChosenEventArgs args)
        {
            //选中后改变搜索文字问当前选择文字
            sender.Text = args.SelectedItem.ToString();
        }

        private async void NavViewSearchBox_QuerySubmitted(AutoSuggestBox sender, AutoSuggestBoxQuerySubmittedEventArgs args)
        {
            try
            {
                string cityName = args.QueryText;
                Weather.Pages.Parameters.getCity(cityName);
               
                var myWeather = await MainAPI.MainAPI.GetWrather(cityName);     //实例化主要天气API
                var mySuggestion = await LifeSuggestionAPI.LifeSuggestionAPI.GetSuggestion(cityName);//实例化生活指数
                var myLocation = await CityToLocation.CityToLocation.GetLocation(cityName);     //使用高德API将城市名转换为经纬度。
                string[] Locations = myLocation.geocodes[0].location.Split(",");        //将用逗号隔开的经纬度分割分别存入。
                double Lat = Convert.ToDouble(Locations[0]);
                double Lon = Convert.ToDouble(Locations[1]);
                var myCurrentWeather = await ProCurrentWeather.ProCurrentWeather.GetProCurrentWeather(Lon, Lat);//实例化高级当前天气API
                var myForecast = await ProForecast.ProForecast.GetProForecast(Lon, Lat);//实例化高级天气预报API





            }

            catch
            {
                mytext.Text = "错误！";
            }
        }

        
        static string[] arrsrc =
       {
           "亚东","帕里","普兰","仲巴","札达","阿里","狮泉河","噶尔","日土","革吉","改则","吉隆","萨嘎","聂拉木","定日","定结","岗巴","拉孜","昂仁","萨迦","谢通门","康马","白朗","日喀则","江孜","仁布","南木林","申扎","措勤","尼玛","塔什库尔干","叶城","皮山","泽普","莎车","英吉沙","阿克陶","岳普湖","麦盖提","乌恰","疏附","疏勒","喀什","阿图什","伽师","巴楚","阿合奇","和田","墨玉","洛浦","策勒","于田","民丰","塔中","双湖","且末","若羌","柯坪","阿瓦提","阿拉尔","乌什","阿克苏","温宿","沙雅","拜城","新和","库车","轮台","昭苏","霍尔果斯","察布查尔","伊宁","霍城","伊宁县","温泉","特克斯","巩留","新源","巴音布鲁克","尼勒克","博乐","精河","尉犁","库尔勒","博湖","焉耆","铁干里克","和静","巴仑台","和硕","小渠子","乌苏","奎屯","沙湾","炮台","呼图壁","石河子","玛纳斯","乌鲁木齐牧试站","达坂城","托克逊","吐鲁番","乌鲁木齐","昌吉","蔡家湖","米泉","五家渠","白杨沟","天池","阜康","吉木萨尔","奇台","阿拉山口","托里","裕民","塔城","额敏","克拉玛依","白碱滩","乌尔禾","莫索湾","和布克赛尔","吉木乃","布尔津","福海","富蕴","哈巴河","阿勒泰","孟连","勐海","景洪","西沙","勐腊","凭祥","龙州","三亚","乐东","五指山","东方","昌江","白沙","儋州","保亭","陵水","万宁","琼中","屯昌","琼海","文昌","临高","涠洲岛","东兴","宁明","崇左","上思","防城港","防城","北海","合浦","钦州","灵山","浦北","澄迈","定安","海口","徐闻","雷州","麻章","湛江","赤坎","遂溪","廉江","霞山","坡头","吴川","化州","电白","茂港","茂名","博白","陆川","高州","信宜","阳西","阳春","阳江","阳东","恩平","南沙","中沙","台山","开平","新会","金湾","斗门","珠海","错那","瑞丽","陇川","盈江","梁河","西盟","沧源","镇康","耿马","澜沧","普洱","宁洱","双江","临沧","景谷","镇沅","芒市","德宏","龙陵","永德","腾冲","施甸","昌宁","保山","凤庆","云县","景东","南涧","巍山","六库","怒江","泸水","永平","云龙","兰坪","弥渡","大理","漾濞","祥云","姚安","宾川","洱源","剑川","鹤庆","永胜","福贡","维西","贡山","中甸","香格里拉","丽江","宁蒗","洛扎","浪卡子","尼木","贡嘎","曲水","札囊","措美","隆子","琼结","乃东","泽当","山南","桑日","曲松","加查","堆龙德庆","拉萨","达孜","林周","当雄","墨竹工卡","朗县","米林","墨脱","工布江达","嘉黎","林芝","边坝","班戈","那曲","安多","聂荣","比如","索县","巴青","丁青","杂多","察隅","波密","八宿","洛隆","左贡","察雅","贡觉","德钦","得荣","乡城","稻城","芒康","巴塘","理塘","雅江","类乌齐","囊谦","昌都","江达","玉树","石渠","称多","白玉","德格","新龙","甘孜","道孚","炉霍","色达","壤塘","班玛","江城","绿春","墨江","元江","石屏","河口","屏边","元阳","个旧","红河","建水","开远","蒙自","新平","峨山","玉溪","双柏","楚雄","南华","易门","晋宁","安宁","禄丰","太华山","富民","通海","华宁","江川","弥勒","泸西","澄江","呈贡","石林","宜良","昆明","师宗","陆良","马关","麻栗坡","文山","西畴","砚山","靖西","那坡","富宁","德保","百色","丘北","广南","西林","罗平","隆林","兴义","田林","凌云","安龙","册亨","望谟","乐业","牟定","大姚","元谋","武定","禄劝","永仁","华坪","仁和","攀枝花","盐边","会理","会东","嵩明","寻甸","马龙","曲靖","沾益","东川","会泽","米易","德昌","普格","盐源","木里","凉山","西昌","宁南","巧家","鲁甸","昭通","布拖","金阳","昭觉","大关","彝良","富源","盘县","兴仁","普安","晴隆","宣威","水城","贞丰","关岭","紫云","罗甸","镇宁","六枝","普定","安顺","织金","长顺","惠水","平坝","清镇","花溪","小河","贵阳","白云","南明","云岩","乌当","威宁","赫章","纳雍","毕节","盐津","镇雄","威信","黔西","大方","修文","息烽","古蔺","金沙","遵义县","仁怀","大新","天等","扶绥","隆安","武鸣","田阳","田东","平果","大化","马山","南宁","邕宁","横县","贵港","上林","宾阳","合山","来宾","武宣","巴马","凤山","东兰","都安","天峨","南丹","河池","环江","忻城","宜州","象州","柳江","柳州","罗城","柳城","融水","融安","兴业","玉林","北流","容县","岑溪","桂平","平南","藤县","罗定","德庆","新兴","云浮","云安","高要","肇庆","苍梧","梧州","郁南","封开","广宁","金秀","鹿寨","荔浦","蒙山","昭平","永福","临桂","桂林","阳朔","平乐","恭城","钟山","贺州","怀集","连山","富川","江永","江华","连南","连州","平塘","独山","荔波","三都","都匀","龙里","贵定","福泉","丹寨","麻江","雷山","凯里","榕江","从江","三江","台江","黎平","锦屏","靖州","开阳","瓮安","黄平","施秉","余庆","红花岗","遵义","汇川","湄潭","绥阳","石阡","凤冈","思南","剑河","镇远","三穗","岑巩","玉屏","天柱","新晃","江口","印江","万山","铜仁","芷江","凤凰","灵川","龙胜","兴安","全州","通道","城步","绥宁","资源","新宁","灌阳","道县","双牌","宁远","蓝山","嘉禾","新田","东安","冷水滩","永州","祁阳","常宁","会同","洪江","中方","武冈","洞口","隆回","怀化","麻阳","辰溪","溆浦","邵阳县","邵阳","新邵","邵东","祁东","衡阳县","冷水江","新化","涟源","娄底","双峰","喜德","冕宁","越西","九龙","石棉","汉源","美姑","雷波","永善","绥江","甘洛","峨边","马边","沐川","峨眉","犍为","康定","泸定","丹巴","荥经","雅安","天全","芦山","名山","峨眉山","夹江","乐山","青神","洪雅","丹棱","蒲江","眉山","彭山","宝兴","邛崃","大邑","新津","双流","崇州","温江","郫县","筠连","高县","珙县","水富","宜宾县","宜宾","兴文","叙永","长宁","江安","纳溪","屏山","荣县","威远","南溪","泸州","泸县","自贡","富顺","赤水","合江","习水","桐梓","荣昌","江津","綦江","合川","巴南","井研","仁寿","资阳","内江","东兴","资中","隆昌","安岳","龙泉驿","简阳","成都","新都","青白江区","金堂","乐至","射洪","大足","永川","铜梁","潼南","璧山","北碚","重庆","渝北","遂宁","蓬溪","南充","武胜","岳池","华蓥","广安","小金","金川","马尔康","理县","都江堰","彭州","汶川","黑水","茂县","阿坝","红原","久治","松潘","若尔盖","广汉","什邡","德阳","中江","绵竹","罗江","安县","绵阳","三台","盐亭","梓潼","江油","北川","西充","南部","阆中","蓬安","仪陇","营山","苍溪","剑阁","巴中","旺苍","平武","文县","青川","九寨沟","武都","广元","南江","宁强","康县","略阳","成县","勉县","正安","德江","务川","万盛","南川","道真","武隆","彭水","秀山","沿河","松桃","花垣","保靖","酉阳","黔江","来凤","龙山","长寿","涪陵","丰都","石柱","邻水","垫江","大竹","渠县","忠县","梁平","咸丰","宣恩","利川","万州","恩施","吉首","泸溪","沅陵","古丈","永顺","桑植","张家界","武陵源","安化","桃江","益阳","赫山区","桃源","常德","慈利","临澧","汉寿","沅江","安乡","南县","鹤峰","五峰","建始","秭归","三峡","石门","澧县","松滋","津市","石首","江陵","公安","长阳","宜都","枝江","宜昌","夷陵","当阳","沙市","荆州","达县","通川","达州","平昌","开江","宣汉","通江","万源","开县","云阳","奉节","巫溪","城口","岚皋","镇坪","南郑","镇巴","西乡","汉中","城固","洋县","留坝","石泉","佛坪","紫阳","汉阴","安康","平利","旬阳","宁陕","镇安","柞水","巫山","巴东","神农架","兴山","竹溪","竹山","房县","远安","掇刀","荆门","保康","谷城","南漳","宜城","襄阳","襄州","白河","茅箭","十堰","张湾","郧西","郧县","山阳","丹凤","商南","老河口","丹江口","邓州","新野","镇平","淅川","西峡","内乡","南召","治多","格尔木","茫崖","大柴旦","冷湖","曲麻莱","多县","玛多","都兰","达日","甘德","玛沁","果洛","兴海","同德","贵南","共和","海南","海西","德令哈","乌兰","天峻","海晏","海北","刚察","肃南","祁连","民乐","张掖","临泽","山丹","阿克塞","肃北","敦煌","鄯善","木垒","哈密","伊吾","巴里坤","嘉峪关","玉门","瓜州","酒泉","金塔","高台","额济纳","玛曲","河南","泽库","碌曲","迭部","岷县","临潭","合作","甘南","卓尼","夏河","同仁","黄南","循化","贵德","湟中","尖扎","化隆","平安","海东","乐都","和政","积石山","临夏","广河","康乐","临洮","东乡","永靖","民和","兰州","皋兰","舟曲","宕昌","西和","礼县","渭源","漳县","陇西","武山","甘谷","徽县","两当","凤县","天水","麦积","清水","秦安","张家川","陇县","榆中","安定","定西","通渭","会宁","白银","庄浪","静宁","隆德","泾源","华亭","崆峒","平凉","彭阳","西吉","固原","湟源","西宁","互助","大通","门源","武威","永登","天祝","古浪","永昌","金昌","阿右旗","民勤","中泉子","靖远","景泰","平川","中卫","孪井滩","海原","同心","中宁","头道湖","锡林高勒","青铜峡","吴忠","灵武","永宁","银川","贺兰","阿左旗","石嘴山","陶乐","平罗","惠农","太白","宝鸡","陈仓","眉县","岐山","扶风","周至","武功","杨凌","千阳","凤翔","麟游","乾县","永寿","灵台","彬县","户县","兴平","长安","西安","咸阳","蓝田","临潼","礼泉","淳化","泾阳","三原","旬邑","铜川","耀县","耀州","高陵","富平","渭南","蒲城","崇信","泾川","镇原","长武","宁县","西峰","庆阳","合水","庆城","华池","正宁","宜君","白水","黄陵","洛川","富县","甘泉","商州","商洛","洛南","卢氏","华县","大荔","华阴","潼关","芮城","灵宝","陕县","永济","临猗","运城","栾川","洛宁","嵩县","汝阳","伊川","三门峡","渑池","平陆","夏县","义马","宜阳","洛阳","新安","孟津","澄城","合阳","黄龙","韩城","万荣","河津","稷山","宜川","吉县","乡宁","大宁","蒲县","闻喜","垣曲","绛县","新绛","侯马","曲沃","翼城","阳城","沁水","襄汾","临汾","洪洞","浮山","安泽","古县","沁源","环县","吴起","盐池","定边","志丹","安塞","延安","子长","靖边","河南","横山","鄂前旗","鄂托克","乌审旗","乌审召","延长","延川","清涧","永和","隰县","石楼","绥德","子洲","米脂","吴堡","柳林","临县","汾西","霍州","灵石","交口","孝义","介休","平遥","中阳","吕梁","离石","汾阳","方山","文水","祁县","交城","清徐","古交","尖草坪区","榆林","榆阳","佳县","保德","伊金霍洛","神木","府谷","娄烦","岚县","兴县","静乐","岢岚","五寨","宁武","神池","朔州","雅布赖","拐子湖","诺尔公","吉兰太","乌斯泰","乌海","那仁宝力格","海力素","伊克乌素","磴口","临河","杭锦旗","乌前旗","杭锦后旗","乌后旗","五原","大佘太","乌中旗","鄂尔多斯","东胜","达拉特","包头","土右旗","河曲","准格尔","偏关","清水河","平鲁","右玉","托县","土左旗","和林","凉城","固阳","白云鄂博","达茂旗","呼和浩特","武川","希拉穆仁","呼市郊区","四子王旗","满都拉","二连浩特","江门","江海","鹤山","蓬江","高明","佛山","三水","南海","中山","顺德","番禺","广州","东莞","四会","清新","清远","花都","增城","从化","佛冈","深圳","惠阳","博罗","惠州","惠东","龙门","河源","东源","紫金","阳山","英德","临武","乳源","曲江","武江","浈江","韶关","乐昌","仁化","新丰","翁源","连平","龙川","和平","始兴","全南","南雄","龙南","定南","汕尾","海丰","陆丰","惠来","陆河","揭西","普宁","潮阳","汕头","金平","揭阳","潮安","丰顺","揭东","潮州","澄海","南澳","饶平","诏安","东山","五华","兴宁","平远","梅县","梅州","大埔","寻乌","安远","蕉岭","武平","上杭","云霄","平和","南靖","漳浦","漳州","龙海","厦门","永定","龙岩","漳平","长泰","华安","宜章","桂阳","郴州","苏仙","汝城","资兴","永兴","耒阳","安仁","炎陵","大余","崇义","上犹","信丰","南康","赣州","赣县","桂东","遂川","宁冈","万安","衡南","衡阳","南岳","衡东","衡山","茶陵","攸县","湘乡","韶山","湘潭","株洲","醴陵","湘东","萍乡","安源","上栗","永新","井冈山","莲花","泰和","吉安县","安福","吉安","吉水","芦溪","宜春","万载","分宜","新余","会昌","于都","长汀","瑞金","兴国","石城","宁化","宁都","连城","永安","大田","清流","明溪","三明","沙县","永丰","广昌","南丰","峡江","新干","乐安","樟树","宜黄","崇仁","南城","抚州","建宁","泰宁","黎川","将乐","顺昌","邵武","建阳","资溪","光泽","金溪","武夷山","同安","石狮","晋江","泉州","安溪","南安","惠安","崇武","秀屿","永春","德化","仙游","城厢","秀屿港","莆田","荔城","涵江","永泰","福清","长乐","尤溪","南平","古田","闽侯","闽清","福州","连江","宁德","平潭","罗源","建瓯","屏南","政和","周宁","松溪","浦城","庆元","寿宁","龙泉","霞浦","福安","柘荣","福鼎","泰顺","景宁","云和","文成","苍南","平阳","瑞安","温州","钓鱼岛","洞头","宁乡","望城","长沙","马坡岭","湘阴","汨罗","浏阳","平江","华容","岳阳","临湘","通城","铜鼓","上高","宜丰","修水","武宁","监利","洪湖","赤壁","嘉鱼","潜江","沙洋","天门","仙桃","汉川","崇阳","通山","咸宁","阳新","梁子湖","铁山","大冶","下陆","黄石","西塞山","蔡甸","江夏","东西湖","孝感","武汉","黄陂","鄂州","黄冈","浠水","团风","新洲","高安","丰城","奉新","南昌县","新建","南昌","进贤","东乡","余干","靖安","安义","永修","德安","鄱阳","都昌","星子","余江","鹰潭","贵溪","万年","弋阳","铅山","横峰","上饶县","上饶","乐平","景德镇","浮梁","德兴","婺源","武穴","瑞昌","庐山","九江","蕲春","黄梅","湖口","宿松","彭泽","望江","罗田","英山","太湖","岳西","潜山","东至","祁门","石台","黟县","安庆","怀宁","枞阳","九华山","池州","青阳","铜陵","钟祥","京山","应城","云梦","安陆","广水","枣阳","随州","孝昌","大悟","红安","麻城","新县","信阳","罗山","光山","潢川","唐河","南阳","桐柏","泌阳","社旗","方城","鲁山","舞钢","叶县","舞阳","正阳","确山","驻马店","汝南","息县","平舆","新蔡","遂平","西平","上蔡","漯河","商水","临泉","项城","周口","淮阳","沈丘","郸城","霍山","商城","金寨","固始","六安","霍邱","桐城","庐江","舒城","无为","巢湖","肥西","合肥","肥东","含山","淮滨","阜南","阜阳","颍上","太和","界首","利辛","蒙城","涡阳","寿县","淮南","长丰","凤台","潘集","怀远","蚌埠","定远","凤阳","明光","固镇","宿州","五河","灵璧","泗县","广丰","玉山","江山","松阳","遂昌","开化","常山","衢州","衢江","龙游","兰溪","建德","丽水","缙云","青田","永嘉","武义","金华","永康","浦江","义乌","东阳","磐安","仙居","新昌","休宁","黄山","屯溪","歙县","黄山风景区","绩溪","淳安","黄山区","旌德","泾县","南陵","宁国","广德","桐庐","诸暨","临安","富阳","嵊州","绍兴","萧山","上虞","杭州","德清","安吉","湖州","余杭","海宁","桐乡","嘉兴","嘉善","乐清","玉环","温岭","黄岩","路桥","洪家","台州","椒江","临海","天台","三门","宁海","象山","奉化","鄞州","宁波","余姚","慈溪","镇海","北仑","定海","普陀","舟山","海盐","平湖","金山","奉贤","岱山","嵊泗","繁昌","宣城","芜湖县","芜湖","当涂","郎溪","高淳","溧阳","和县","马鞍山","全椒","滁州","浦口","江浦","南京","溧水","江宁","句容","丹徒","仪征","镇江","长兴","宜兴","吴江","吴中","苏州","无锡","锡山","金坛","武进","常州","丹阳","扬中","泰兴","江阴","张家港","常熟","南通","靖江","来安","盱眙","六合","邗江","扬州","天长","金湖","高邮","泗洪","泗阳","洪泽","宝应","淮安","淮阴区","淮安区","江都","泰州","姜堰","兴化","如皋","海安","东台","盐都","盐城","建湖","大丰","松江","青浦","闵行","徐家汇","上海","浦东","昆山","太仓","嘉定","宝山","崇明","浦东南汇","海门","通州","如东","启东","石龙","平顶山","宝丰","汝州","襄城","郏县","许昌","禹州","长葛","新郑","偃师","登封","巩义","吉利","孟州","济源","温县","沁阳","新密","荥阳","郑州","上街","武陟","临颍","鄢陵","西华","扶沟","尉氏","太康","柘城","睢县","中牟","通许","开封","原阳","延津","封丘","杞县","民权","兰考","泽州","博爱","晋城","高平","焦作","修武","获嘉","新乡","辉县","陵川","长子","壶关","长治","屯留","襄垣","平顺","林州","潞城","黎城","卫辉","淇县","滑县","浚县","鹤壁","长垣","东明","濮阳","汤阴","安阳","峰峰","磁县","内黄","清丰","南乐","临漳","魏县","成安","肥乡","广平","大名","馆陶","鹿邑","亳州","宁陵","商丘","虞城","永城","夏邑","砀山","曹县","定陶","成武","单县","丰县","金乡","鱼台","濉溪","淮北","萧县","铜山","徐州","睢宁","邳州","沛县","薛城","微山","枣庄","滕州","台儿庄","峄城","兰陵","菏泽","鄄城","郓城","巨野","嘉祥","济宁","梁山","汶上","范县","台前","阳谷","冠县","莘县","聊城","东平","东阿","平阴","邹城","兖州","曲阜","宁阳","泗水","平邑","费县","蒙阴","肥城","泰安","长清","新泰","莱芜","博山","沁县","武乡","榆社","涉县","左权","太谷","小店区","晋中","榆次","太原","寿阳","和顺","昔阳","平定","阳泉","武安","邯郸","永年","沙河","邢台","曲周","邱县","南和","鸡泽","任县","平乡","威县","广宗","巨鹿","内丘","临城","高邑","赞皇","元氏","隆尧","柏乡","新河","赵县","宁晋","栾城","辛集","阳曲","忻州","定襄","盂县","原平","代县","五台县","五台山","繁峙","井陉","平山","鹿泉","石家庄","灵寿","正定","行唐","藁城","晋州","无极","深泽","新乐","曲阳","定州","阜平","唐县","顺平","望都","涞源","临西","临清","清河","夏津","茌平","高唐","武城","禹城","平原","南宫","冀州","故城","枣强","衡水","武邑","德州","陵县","景县","阜城","吴桥","东光","济南","齐河","临邑","济阳","章丘","邹平","淄川","周村","淄博","桓台","高青","商河","宁津","乐陵","庆云","惠民","滨州","阳信","无棣","深州","安平","武强","饶阳","安国","博野","蠡县","肃宁","献县","南皮","泊头","河间","清苑","保定","满城","徐水","高阳","安新","易县","容城","定兴","高碑店","任丘","雄县","大城","文安","霸州","永清","沧州","沧县","盐山","孟村","青县","黄骅","海兴","静海","津南","西青","天津","东丽","北辰","大港","塘沽","汉沽","宁河","宿迁","宿豫","新沂","沭阳","涟水","灌南","灌云","郯城","东海","临沂","临沭","连云港","赣榆","阜宁","滨海","响水","射阳","沂南","沂水","莒南","日照","莒县","五莲","沂源","临朐","诸城","安丘","黄岛","高密","胶州","青岛","崂山","即墨","青州","临淄","昌乐","寿光","广饶","博兴","潍坊","昌邑","利津","东营","垦利","沾化","河口","平度","莱州","莱西","莱阳","招远","栖霞","龙口","蓬莱","长岛","曹妃甸","唐海","海阳","乳山","文登","福山","牟平","烟台","威海","石岛","荣成","成山头","旅顺","大连","金州","长海","山阴","应县","左云","怀仁","浑源","大同县","丰镇","大同","阳高","察右前旗","灵丘","广灵","蔚县","阳原","天镇","怀安","涿鹿","万全","宣化","卓资","集宁","察右中旗","察右后旗","兴和","商都","尚义","张家口","崇礼","张北","化德","康保","太仆寺","涞水","涿州","固安","廊坊","房山","大兴","石景山","丰台","门头沟","海淀","北京","朝阳","通州","怀来","延庆","昌平","顺义","怀柔","武清","宝坻","香河","大厂","三河","蓟县","丰南","玉田","密云","平谷","遵化","兴隆","赤城","丰宁","沽源","多伦","滦平","承德","隆化","围场","朱日和","苏右旗","镶黄旗","正镶白旗","苏左旗","阿巴嘎","正蓝旗","克什克腾","锡林浩特","林西","西乌旗","唐山","滦南","丰润","滦县","迁安","乐亭","昌黎","卢龙","抚宁","北戴河","迁西","承德县","宽城","青龙","秦皇岛","绥中","兴城","葫芦岛","平泉","凌源","八里罕","喀喇沁","宁城","建昌","喀左","建平县","朝阳","北票","普兰店","瓦房店","营口","庄河","盖州","大石桥","岫岩","锦州","凌海","大洼","盘锦","盘山","义县","北镇","黑山","阜新","海城","鞍山","台安","弓长岭","辽阳县","辽阳","灯塔","辽中","新民","沈阳","岗子","赤峰","巴林右旗","翁牛特","敖汉","宝国吐","奈曼","巴林左旗","浩尔吐","阿鲁旗","扎鲁特","青龙山","库伦","彰武","法库","调兵山","康平","科左后旗","双辽","开鲁","通辽","舍伯吐","高力板","科左中旗","通榆","东港","丹东","凤城","宽甸","本溪","本溪县","抚顺","章党","新宾","清原","桓仁","集安","通化县","通化","白山","临江","江源","东岗","长白","铁岭","开原","昌图","西丰","辽源","四平","梨树","东辽","公主岭","柳河","梅河口","东丰","辉南","伊通","双阳","磐石","长岭","前郭","长春","九台","永吉","吉林","农安","德惠","扶余","榆树","靖宇","抚松","桦甸","和龙","敦化","安图","蛟河","舒兰","五常","龙井","延吉","珲春","图们","汪清","宁安","海林","牡丹江","穆棱","东宁","绥芬河","青河","东乌旗","新右旗","满洲里","乌拉盖","霍林郭勒","巴雅尔吐胡硕","阿尔山","科右中旗","突泉","科右前旗","乌兰浩特","洮南","白城","镇赉","泰来","索伦","胡尔勒","扎赉特","龙江","新左旗","鄂温克旗","海拉尔","陈旗","牙克石","额尔古纳","博克图","扎兰屯","阿荣旗","小二沟","图里河","根河","呼中","漠河","乾安","大安","松原","肇源","肇州","双城","安达","哈尔滨","肇东","兰西","杜尔伯特","大庆","齐齐哈尔","林甸","青冈","望奎","明水","拜泉","阿城","尚志","呼兰","宾县","巴彦","延寿","木兰","方正","通河","绥化","庆安","绥棱","海伦","铁力","伊春","富裕","莫力达瓦","讷河","依安","克山","克东","北安","嫩江","五大连池","鄂伦春旗","加格达奇","大兴安岭","五营","孙吴","黑河","逊克","林口","依兰","勃利","桦南","鸡东","鸡西","密山","七台河","汤原","佳木斯","桦川","鹤岗","集贤","双鸭山","友谊","萝北","绥滨","富锦","宝清","虎林","同江","饶河","乌伊岭","嘉荫","抚远","新林","塔河","呼玛"
        };
    }
}
